num = int(input('Введите число от 3 до 20: '))
resultat = ''
while num < 3 or num > 20:
    num = int(input('Ваше число не удовлетворяет условию. Введите число от 3 до 20: '))
for i in range (1, num):
        for j in range (i+1, num):
            if  num % (i + j) == 0 or i + j == num:
                resultat += f'{i}{j}'

print(resultat)
password = (12, 13, 1423, 121524, 162534, 13172635, 1218273645, 141923283746, 11029384756, 12131511124210394857,
            112211310495867, 1611325212343114105968, 1214114232133124115106978, 1317115262143531341251161079,
            11621531441351261171089, 12151811724272163631545414513612711810, 118217316415514613712811910,
            13141911923282183731746416515614713812911)
print(resultat == str(password[num-3]))